SM_для_EDT/src/Reports/рарусОтчетПоЗамечаниям/рарусОтчетПоЗамечаниям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>рарусОтчетПоЗамечаниям</name>
</mdclass:Report>

SM_для_EDT/src/Enums/vftСтатусыДокументовСообщений/vftСтатусыДокументовСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>vftСтатусыДокументовСообщений</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Инициировано</name>
  </enumValues>
  <enumValues>
    <name>Проведено</name>
  </enumValues>
  <enumValues>
    <name>ОтправленНаСудно</name>
  </enumValues>
  <enumValues>
    <name>ОтправленНаДоработку</name>
  </enumValues>
  <enumValues>
    <name>Доработан</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Enums/рарусТипыМероприятия/рарусТипыМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рарусТипыМероприятия</name>
  <enumValues>
    <name>ОсвидетельствованиеСудна</name>
  </enumValues>
  <enumValues>
    <name>ОсвидетельствованиеКомпании</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийАудит</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннийАудит</name>
  </enumValues>
  <enumValues>
    <name>Учение</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Documents/рарусМероприятиеСУБ/рарусМероприятиеСУБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>рарусМероприятиеСУБ</name>
  <posting>Deny</posting>
  <attributes>
    <name>ФИОКапитана</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Судно</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиоИнспектора</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезультатВыполнения</name>
    <type>
      <types>EnumRef.рарусРезультатыВыполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролирующийОрган</name>
    <type>
      <types>CatalogRef.рарусКонтролирующиеОрганы</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.рарусВидыМероприятийСУБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтрокиПланГрафика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МероприятиеПоПлану</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеМероприятия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Анкета</name>
    <type>
      <types>DocumentRef.Анкета</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИнспекции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.vftСтатусыДокументовСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументыСудов</name>
    <type>
      <types>CatalogRef.рарусСвидетельстваСудов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьСоздания</name>
    <type>
      <types>EnumRef.рарусОбластиРедактирования</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтчетаOCIMF</name>
    <comment>zalikh, для связи с отчетом аудитора с сайта OCIMF</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Требования</name>
    <comment>zalikh</comment>
    <attributes>
      <name>Требование</name>
      <type>
        <types>CatalogRef.рарусТребования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/Catalogs/vftГруппыСудов/vftГруппыСудов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>vftГруппыСудов</name>
  <tabularSections>
    <name>Суда</name>
    <attributes>
      <name>Судно</name>
      <type>
        <types>CatalogRef.vftСуда</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SM_для_EDT/src/Catalogs/рарусСправочникСсылок/рарусСправочникСсылок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рарусСправочникСсылок</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>FSC</name>
      <description>FSC</description>
    </items>
    <items>
      <name>PSC</name>
      <description>PSC</description>
    </items>
    <items>
      <name>ГПК</name>
      <description>ГПК</description>
    </items>
    <items>
      <name>ДиректоруПоЭксплуатации</name>
      <description>Директор по эксплуатации в родительном падеже</description>
    </items>
    <items>
      <name>ИнтервалМеждуРейсами</name>
      <description>Интервал между рейсами, часы</description>
    </items>
    <items>
      <name>МаслоГД</name>
      <description>Масло ГД</description>
    </items>
    <items>
      <name>МаслоДГ</name>
      <description>Масло ДГ</description>
    </items>
    <items>
      <name>МинКоличествоСтрокАзов</name>
      <description>Мин. кол-во строк в табл. части &quot;Прохождение Азов&quot;</description>
    </items>
    <items>
      <name>МинКоличествоСтрокКЕК</name>
      <description>Мин. кол-во строк в табл. части &quot;Прохождение КЕК&quot;</description>
    </items>
    <items>
      <name>МинКоличествоСтрокЛоцман</name>
      <description>Мин. кол-во строк в табл. части &quot;Прохождение участков с лоцманом&quot;</description>
    </items>
    <items>
      <name>МинКоличествоСтрокРостов</name>
      <description>Мин. кол-во строк в табл. части &quot;Прохождение Ростов&quot;</description>
    </items>
    <items>
      <name>МодельРДО_ННФ</name>
      <description>Модель РДО (Нефтеналивной флот)</description>
    </items>
    <items>
      <name>МодельРДО_СГФ</name>
      <description>Модель РДО (Сухогрузный флот)</description>
    </items>
    <items>
      <name>МодельРДО_СЗП</name>
      <description>Модель РДО (Морской сухогрузный флот)</description>
    </items>
    <items>
      <name>РМРС</name>
      <description>РМРС</description>
    </items>
    <items>
      <name>ТопливоМТ01</name>
      <description>МТ 0.1</description>
    </items>
    <items>
      <name>ТопливоМТ05</name>
      <description>МТ 0.5</description>
    </items>
    <items>
      <name>ТопливоМТ15</name>
      <description>МТ 1.5</description>
    </items>
    <items>
      <name>ТопливоСМТ</name>
      <description>СМТ</description>
    </items>
  </predefined>
  <attributes>
    <name>Значение</name>
    <type>
      <types>CatalogRef.vftТиповыеОперации</types>
      <types>CatalogRef.Номенклатура</types>
      <types>String</types>
      <types>CatalogRef.vftПунктыСледования</types>
      <types>Number</types>
      <types>CatalogRef.рарусУчасткиСОЛП</types>
      <types>CatalogRef.впМодельРДО</types>
      <types>CatalogRef.рарусКонтролирующиеОрганы</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

SM_для_EDT/src/Catalogs/рарусВидыМероприятийСУБ/рарусВидыМероприятийСУБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рарусВидыМероприятийСУБ</name>
  <attributes>
    <name>ТипМероприятия</name>
    <type>
      <types>EnumRef.рарусТипыМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Обозначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектМероприятия</name>
    <type>
      <types>EnumRef.рарусВидыВладельцевДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОсвидетельствования</name>
    <type>
      <types>CatalogRef.рарусТипыОсвидетельствования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.рарусВидыДокументовОсвидетельствования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМероприятия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>String</types>
      <types>CatalogRef.vftПодразделенияКомпании</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодическоеМероприятие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетРезультатВыполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонОпроса</name>
    <type>
      <types>CatalogRef.ШаблоныАнкет</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтролирующийОрган</name>
    <type>
      <types>CatalogRef.рарусКонтролирующиеОрганы</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактерМероприятия</name>
    <type>
      <types>EnumRef.рарусХарактерМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуютсяКодыЗамечанийИСроковУстранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Конвенция</name>
    <type>
      <types>CatalogRef.рарусКонвенции</types>
    </type>
  </attributes>
</mdclass:Catalog>

SM_для_EDT/src/Catalogs/vftДокладыОНесоответствии/vftДокладыОНесоответствии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>vftДокладыОНесоответствии</name>
  <predefined>
    <items>
      <name>рарусВременныйДоклад</name>
    </items>
  </predefined>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.vftСтатусыДокументовСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОКапитана</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Судно</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветКомпании</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОИнспектора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнспектирующийОрган</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоИнспекции</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИнспекции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокУстранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоклада</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияДоклада</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

SM_для_EDT/src/Reports/рарусОтчетПоЗамечаниям/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОписаниеПеременных

Перем Период,
НачалоПериода Экспорт,
КонецПериода Экспорт, 
ИспользованиеПериода Экспорт,
ГруппаСудов Экспорт, 
ОтветственноеПодразделение Экспорт, 
ДатаОтчета Экспорт, 
ИспользованиеГруппыСудов Экспорт, 
ИспользоватьОтборПоПодразделениям Экспорт,  
КэшированныеЗначения;

#КонецОбласти
		
#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	Настройки.События.ПриСозданииНаСервере = Истина;
КонецПроцедуры

Процедура ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
	КомпоновщикНастроекФормы = ЭтаФорма.Отчет.КомпоновщикНастроек;
	Параметры = ЭтаФорма.Параметры;
	
	//Если Параметры.Свойство("ПараметрКоманды") Тогда
	//	
	//	ЭтаФорма.ФормаПараметры.Отбор.Вставить("ВладелецЗамечания", Параметры.ПараметрКоманды.Ссылка);

	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти	
	
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПользовательскиеНастройкиМодифицированы = Ложь;
	
	УстановитьОбязательныеНастройки(ПользовательскиеНастройкиМодифицированы);
	
	// Подготовим и выведем отчет.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;    
	
	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();

	МакетКомпоновки = КомпоновщикМакета.Выполнить(
	СхемаКомпоновкиДанных,
	НастройкиКомпоновкиДанных,
	ДанныеРасшифровки);
		
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	
	КлючВарианта = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("КлючВарианта", КлючВарианта);
		
	ТаблицаДанных = СформироватьДанныеПоЗамечаниям(КлючВарианта);
	
	ВнешниеНаборыДанных = Новый Структура("ТаблицаДанных", ТаблицаДанных);
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.НачатьВывод();
	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	
	ПроцессорВывода.ЗакончитьВывод();
	
	// Сообщим форме отчета, что настройки модифицированы
	Если ПользовательскиеНастройкиМодифицированы Тогда
		КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПользовательскиеНастройкиМодифицированы", Истина);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьОбязательныеНастройки(ПользовательскиеНастройкиМодифицированы) Экспорт
	
	ПараметрПериод = ПолучитьПараметр(КомпоновщикНастроек, "ДатаОтчета");
	
	ДатаОтчета =  ПараметрПериод.Значение.Дата;
	
	//rarus_AfoD 20.09.2021 < 
	КлючВарианта = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("КлючВарианта", КлючВарианта);
	//rarus_AfoD 20.09.2021 > 
	
	ПараметрПериодНовый = ПолучитьПараметр(КомпоновщикНастроек, "Период");
	
	ИспользованиеПериода = Ложь;
	//rarus_AfoD 20.09.2021 < 
	Если ПараметрПериодНовый.Использование И КлючВарианта = "СводныйВариант" Тогда
	
		ПараметрПериодНовый.Использование = Ложь;
	
	КонецЕсли; 
	//rarus_AfoD 20.09.2021 > 
	
	Если ПараметрПериодНовый.Использование Тогда
		ИспользованиеПериода = Истина;
	КонецЕсли;
	
	//rarus_AfoD 20.09.2021 < 
	Если КлючВарианта = "СводныйВариант" Тогда
	
		ПараметрПериодНовый.Значение.ДатаНачала = '00010101';
		ПараметрПериодНовый.Значение.ДатаОкончания = ДатаОтчета;
	
	КонецЕсли; 
	//rarus_AfoD 20.09.2021 > 
	
	НачалоПериода = ?(ПараметрПериодНовый.Использование, ПараметрПериодНовый.Значение.ДатаНачала, НачалоГода(ТекущаяДатаСеанса()));
	КонецПериода = ?(ПараметрПериодНовый.Использование, ПараметрПериодНовый.Значение.ДатаОкончания, ТекущаяДатаСеанса());
		
	ПараметрДатаОтчета = ПолучитьПараметр(КомпоновщикНастроек, "ГруппаСудов");
		
	ИспользованиеГруппыСудов = Ложь;
	Если ПараметрДатаОтчета.Использование Тогда
		ИспользованиеГруппыСудов = Истина;
		ГруппаСудов  = ПараметрДатаОтчета.Значение;
	КонецЕсли;
	
	ПараметрДатаОтчета = ПолучитьПараметр(КомпоновщикНастроек, "ОтветственноеПодразделение");
	
	ИспользоватьОтборПоПодразделениям = Ложь;
	Если ПараметрДатаОтчета.Использование Тогда
		ИспользоватьОтборПоПодразделениям = Истина;
		ОтветственноеПодразделение = ПараметрДатаОтчета.Значение;
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьПараметр(ОбъектНастройки, Параметр) Экспорт
	
	ЗначениеПараметра = Неопределено;
	ПолеПараметр = ?(ТипЗнч(Параметр) = Тип("Строка"), Новый ПараметрКомпоновкиДанных(Параметр), Параметр);
	
	Если ТипЗнч(ОбъектНастройки) = Тип("НастройкиКомпоновкиДанных") Тогда
		ЗначениеПараметра = ОбъектНастройки.ПараметрыДанных.НайтиЗначениеПараметра(ПолеПараметр);
	ИначеЕсли ТипЗнч(ОбъектНастройки) = Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
		Для Каждого ЭлементНастройки Из ОбъектНастройки.Элементы Цикл
			Если ТипЗнч(ЭлементНастройки) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных")
			   И ЭлементНастройки.Параметр = ПолеПараметр Тогда
				ЗначениеПараметра = ЭлементНастройки;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ОбъектНастройки) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		Для Каждого ЭлементНастройки Из ОбъектНастройки.ПользовательскиеНастройки.Элементы Цикл
			Если ТипЗнч(ЭлементНастройки) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных")
			   И ЭлементНастройки.Параметр = ПолеПараметр Тогда
				ЗначениеПараметра = ЭлементНастройки;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЗначениеПараметра = Неопределено Тогда
			ЗначениеПараметра = ОбъектНастройки.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПолеПараметр);
		КонецЕсли;
		Если ЗначениеПараметра = Неопределено Тогда
			ЗначениеПараметра = ОбъектНастройки.ФиксированныеНастройки.ПараметрыДанных.НайтиЗначениеПараметра(ПолеПараметр);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ОбъектНастройки) = Тип("НастройкиВложенногоОбъектаКомпоновкиДанных") Тогда
		ЗначениеПараметра = ОбъектНастройки.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПолеПараметр);
	ИначеЕсли ТипЗнч(ОбъектНастройки) = Тип("ДанныеРасшифровкиКомпоновкиДанных") Тогда
		ЗначениеПараметра = ОбъектНастройки.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПолеПараметр);
	ИначеЕсли ТипЗнч(ОбъектНастройки) = Тип("КоллекцияЗначенийПараметровКомпоновкиДанных") Тогда
		ЗначениеПараметра = ОбъектНастройки.Найти(ПолеПараметр);
	ИначеЕсли ТипЗнч(ОбъектНастройки) = Тип("ОформлениеКомпоновкиДанных") Тогда
		ЗначениеПараметра = ОбъектНастройки.НайтиЗначениеПараметра(ПолеПараметр);
	КонецЕсли;
	
	Возврат ЗначениеПараметра;
	
КонецФункции

Функция СформироватьДанныеПоЗамечаниям(КлючВарианта)  Экспорт
	
	Если КлючВарианта = "СводныйВариант" Тогда
		
		ТекстЗапроса = ПолучитьТекстЗапросаДляСводногоВарианта();
		
	ИначеЕсли КлючВарианта = "ЗамечанияPSCFSCГПК" Тогда
		
		ТекстЗапроса = ПолучитьТекстЗапросаДляВариантаОтчетаЗамечанияPSCFSCГПК();
		
	ИначеЕсли КлючВарианта = "ЗамечанияРМРС" Тогда
		
		ТекстЗапроса = ПолучитьТекстЗапросаДляВариантаОтчетаЗамечанияРМРС();
		
	ИначеЕсли КлючВарианта = "ЗамечанияПоВнутреннимАудитамИПроверкам" Тогда
		
		ТекстЗапроса = ПолучитьТекстЗапросаДляВариантаЗамечанийПоВнутреннимАудитамИПроверкам();
		
	ИначеЕсли КлючВарианта = "СводныйВариантКонтекст" Тогда
		
		ТекстЗапроса = ПолучитьТекстЗапросаДляСводногоВарианта();
		
	Иначе
		
		ТекстЗапроса = ПолучитьТекстЗапросаДляПрочегоВариантОтчета();
		
	КонецЕсли;
	
	УсловиеОтбора = "";
	
	Если ИспользованиеГруппыСудов Тогда
		
		УсловиеОтбора = УсловиеОтбора + "vftНесоответствия.Судно В
		| (ВЫБРАТЬ
		|	ГруппыСудов.Судно КАК Судно
		|ИЗ
		|	Справочник.vftГруппыСудов.Суда КАК ГруппыСудов
		|ГДЕ
		|	ГруппыСудов.Ссылка = &ГруппаСудов)";			
	КонецЕсли;
	
	Если ИспользоватьОтборПоПодразделениям Тогда
		Если ЗначениеЗаполнено(УсловиеОтбора) Тогда		
			УсловиеОтбора = УсловиеОтбора + " И ";
		КонецЕсли;		
		УсловиеОтбора = УсловиеОтбора + "vftНесоответствия.ЗоныОтветственности.ЗанаОтветственности В (&Подразделение)";		
	КонецЕсли;
		
	Если ЗначениеЗаполнено(УсловиеОтбора) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&УсловиеОтбора", УсловиеОтбора);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&УсловиеОтбора", "ИСТИНА");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Если ИспользованиеПериода Тогда
		Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);	
		Запрос.УстановитьПараметр("КонецПериода",  КонецПериода);	
	Иначе		
		Запрос.УстановитьПараметр("ДатаОтчета", ДатаОтчета);		
	КонецЕсли;
	
	Если ИспользованиеГруппыСудов Тогда
		Запрос.УстановитьПараметр("ГруппаСудов", ГруппаСудов);
	КонецЕсли;
	
	Если ИспользоватьОтборПоПодразделениям Тогда		
		Запрос.УстановитьПараметр("Подразделение", ОтветственноеПодразделение);		
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьТекстЗапросаДляВариантаОтчетаЗамечанияPSCFSCГПК()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	рарусСправочникСсылок.Значение КАК Значение
	               |ПОМЕСТИТЬ втОтборPSC
	               |ИЗ
	               |	Справочник.рарусСправочникСсылок КАК рарусСправочникСсылок
	               |ГДЕ
	               |	рарусСправочникСсылок.Ссылка = ЗНАЧЕНИЕ(Справочник.рарусСправочникСсылок.PSC)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	рарусСправочникСсылок.Значение КАК Значение
	               |ПОМЕСТИТЬ втОтборFSC
	               |ИЗ
	               |	Справочник.рарусСправочникСсылок КАК рарусСправочникСсылок
	               |ГДЕ
	               |	рарусСправочникСсылок.Ссылка = ЗНАЧЕНИЕ(Справочник.рарусСправочникСсылок.FSC)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	рарусСправочникСсылок.Значение КАК Значение
	               |ПОМЕСТИТЬ втОтборГПК
	               |ИЗ
	               |	Справочник.рарусСправочникСсылок КАК рарусСправочникСсылок
	               |ГДЕ
	               |	рарусСправочникСсылок.Ссылка = ЗНАЧЕНИЕ(Справочник.рарусСправочникСсылок.ГПК)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	vftНесоответствия.Ссылка КАК Ссылка,
	               |	vftНесоответствия.КодУстраненияЗамечания КАК Код,
	               |	vftНесоответствия.Судно КАК ОбъектПроверки,
	               |	МероприятиеСУБ.КонтролирующийОрган КАК КонтролирующийОрган,
	               |	МероприятиеСУБ.ФиоИнспектора КАК ФиоИнспектора,
	               |	МероприятиеСУБ.ДатаИнспекции КАК ДатаИнспекции,
	               |	vftНесоответствия.ТипЗамечания КАК ТипыЗамечаний,
	               |	vftНесоответствия.ПовторяющеесяЗамечания КАК ПовторяющеесяЗамечания,
	               |	МероприятиеСУБ.МестоПроведения КАК МестоИнспекции,
	               |	ВЫБОР
	               |		КОГДА vftНесоответствия.Статус = ЗНАЧЕНИЕ(перечисление.vftСтатусыДокументовСообщений.Закрыт)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Закрыто,
	               |	vftНесоответствия.ПланируемыеСрокиУстранения КАК СрокиУстраненияДо,
	               |	vftНесоответствия.КодЗамечаний КАК КодЗамечаний,
	               |	vftНесоответствия.ЗамечаниеЗакрыто КАК ЗамечаниеЗакрыто,
	               |	"""" КАК Служба,
	               |	vftНесоответствия.ПКДОтправлен КАК ПКДОтправлен,
	               |	vftСуда.Проект КАК ПроектСудна,
	               |	рарусВидыМероприятийСУБ.ТипМероприятия КАК ТипМероприятия,
	               |	vftНесоответствия.ОтчетОВыполненииПКДОтправлен КАК ОтчетОВыполненииПКДОтправлен,
	               |	vftНесоответствия.ДатаОтправкиОтчета КАК ДатаОтправкиОтчета
	               |ПОМЕСТИТЬ втСводнаяТаблица
	               |ИЗ
	               |	Справочник.vftНесоответствия КАК vftНесоответствия
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.рарусМероприятиеСУБ КАК МероприятиеСУБ
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.рарусВидыМероприятийСУБ КАК рарусВидыМероприятийСУБ
	               |			ПО МероприятиеСУБ.ВидМероприятия = рарусВидыМероприятийСУБ.Ссылка
	               |		ПО vftНесоответствия.ВладелецЗамечания = МероприятиеСУБ.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.vftСуда КАК vftСуда
	               |		ПО vftНесоответствия.Судно = vftСуда.Ссылка
	               |ГДЕ
	               |	vftНесоответствия.Статус <> ЗНАЧЕНИЕ(перечисление.vftСтатусыДокументовСообщений.Черновик)
	               |	И НЕ vftНесоответствия.ПометкаУдаления
	               |	И vftНесоответствия.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И МероприятиеСУБ.КонтролирующийОрган В ИЕРАРХИИ
	               |			(ВЫБРАТЬ
	               |				втОтборPSC.Значение КАК Значение
	               |			ИЗ
	               |				втОтборPSC КАК втОтборPSC)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	vftНесоответствия.Ссылка,
	               |	vftНесоответствия.КодУстраненияЗамечания,
	               |	vftНесоответствия.Судно,
	               |	МероприятиеСУБ.КонтролирующийОрган,
	               |	МероприятиеСУБ.ФиоИнспектора,
	               |	МероприятиеСУБ.ДатаИнспекции,
	               |	vftНесоответствия.ТипЗамечания,
	               |	vftНесоответствия.ПовторяющеесяЗамечания,
	               |	МероприятиеСУБ.МестоПроведения,
	               |	ВЫБОР
	               |		КОГДА vftНесоответствия.Статус = ЗНАЧЕНИЕ(перечисление.vftСтатусыДокументовСообщений.Закрыт)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ,
	               |	vftНесоответствия.ПланируемыеСрокиУстранения,
	               |	vftНесоответствия.КодЗамечаний,
	               |	vftНесоответствия.ЗамечаниеЗакрыто,
	               |	"""",
	               |	vftНесоответствия.ПКДОтправлен,
	               |	vftСуда.Проект,
	               |	рарусВидыМероприятийСУБ.ТипМероприятия,
	               |	vftНесоответствия.ОтчетОВыполненииПКДОтправлен,
	               |	vftНесоответствия.ДатаОтправкиОтчета
	               |ИЗ
	               |	Справочник.vftНесоответствия КАК vftНесоответствия
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.рарусМероприятиеСУБ КАК МероприятиеСУБ
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.рарусВидыМероприятийСУБ КАК рарусВидыМероприятийСУБ
	               |			ПО МероприятиеСУБ.ВидМероприятия = рарусВидыМероприятийСУБ.Ссылка
	               |		ПО vftНесоответствия.ВладелецЗамечания = МероприятиеСУБ.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.vftСуда КАК vftСуда
	               |		ПО vftНесоответствия.Судно = vftСуда.Ссылка
	               |ГДЕ
	               |	vftНесоответствия.Статус <> ЗНАЧЕНИЕ(перечисление.vftСтатусыДокументовСообщений.Черновик)
	               |	И НЕ vftНесоответствия.ПометкаУдаления
	               |	И vftНесоответствия.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И МероприятиеСУБ.КонтролирующийОрган В ИЕРАРХИИ
	               |			(ВЫБРАТЬ
	               |				втОтборFSC.Значение КАК Значение
	               |			ИЗ
	               |				втОтборFSC КАК втОтборFSC)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	vftНесоответствия.Ссылка,
	               |	vftНесоответствия.КодУстраненияЗамечания,
	               |	vftНесоответствия.Судно,
	               |	МероприятиеСУБ.КонтролирующийОрган,
	               |	МероприятиеСУБ.ФиоИнспектора,
	               |	МероприятиеСУБ.ДатаИнспекции,
	               |	vftНесоответствия.ТипЗамечания,
	               |	vftНесоответствия.ПовторяющеесяЗамечания,
	               |	МероприятиеСУБ.МестоПроведения,
	               |	ВЫБОР
	               |		КОГДА vftНесоответствия.Статус = ЗНАЧЕНИЕ(перечисление.vftСтатусыДокументовСообщений.Закрыт)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ,
	               |	vftНесоответствия.ПланируемыеСрокиУстранения,
	               |	vftНесоответствия.КодЗамечаний,
	               |	vftНесоответствия.ЗамечаниеЗакрыто,
	               |	"""",
	               |	vftНесоответствия.ПКДОтправлен,
	               |	vftСуда.Проект,
	               |	рарусВидыМероприятийСУБ.ТипМероприятия,
	               |	vftНесоответствия.ОтчетОВыполненииПКДОтправлен,
	               |	vftНесоответствия.ДатаОтправкиОтчета
	               |ИЗ
	               |	Справочник.vftНесоответствия КАК vftНесоответствия
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.рарусМероприятиеСУБ КАК МероприятиеСУБ
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.рарусВидыМероприятийСУБ КАК рарусВидыМероприятийСУБ
	               |			ПО МероприятиеСУБ.ВидМероприятия = рарусВидыМероприятийСУБ.Ссылка
	               |		ПО vftНесоответствия.ВладелецЗамечания = МероприятиеСУБ.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.vftСуда КАК vftСуда
	               |		ПО vftНесоответствия.Судно = vftСуда.Ссылка
	               |ГДЕ
	               |	vftНесоответствия.Статус <> ЗНАЧЕНИЕ(перечисление.vftСтатусыДокументовСообщений.Черновик)
	               |	И НЕ vftНесоответствия.ПометкаУдаления
	               |	И vftНесоответствия.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И МероприятиеСУБ.КонтролирующийОрган В ИЕРАРХИИ
	               |			(ВЫБРАТЬ
	               |				втОтборГПК.Значение КАК Значение
	               |			ИЗ
	               |				втОтборГПК КАК втОтборГПК)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	vftНесоответствия.Ссылка,
	               |	vftНесоответствия.КодУстраненияЗамечания,
	               |	vftНесоответствия.Судно,
	               |	ЗНАЧЕНИЕ(Справочник.рарусКонтролирующиеОрганы.ПустаяСсылка),
	               |	"""",
	               |	vftДокладыОНесоответствии.Дата,
	               |	vftНесоответствия.ТипЗамечания,
	               |	vftНесоответствия.ПовторяющеесяЗамечания,
	               |	"""",
	               |	ВЫБОР
	               |		КОГДА vftНесоответствия.Статус = ЗНАЧЕНИЕ(перечисление.vftСтатусыДокументовСообщений.Закрыт)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ,
	               |	vftНесоответствия.ПланируемыеСрокиУстранения,
	               |	vftНесоответствия.КодЗамечаний,
	               |	vftНесоответствия.ЗамечаниеЗакрыто,
	               |	"""",
	               |	vftНесоответствия.ПКДОтправлен,
	               |	vftСуда.Проект,
	               |	ЗНАЧЕНИЕ(перечисление.рарусТипыМероприятия.ПустаяСсылка),
	               |	vftНесоответствия.ОтчетОВыполненииПКДОтправлен,
	               |	vftНесоответствия.ДатаОтправкиОтчета
	               |ИЗ
	               |	Справочник.vftНесоответствия КАК vftНесоответствия
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.vftДокладыОНесоответствии КАК vftДокладыОНесоответствии
	               |		ПО vftНесоответствия.ВладелецЗамечания = vftДокладыОНесоответствии.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.vftСуда КАК vftСуда
	               |		ПО vftНесоответствия.Судно = vftСуда.Ссылка
	               |ГДЕ
	               |	vftНесоответствия.Статус <> ЗНАЧЕНИЕ(перечисление.vftСтатусыДокументовСообщений.Черновик)
	               |	И НЕ vftНесоответствия.ПометкаУдаления
	               |	И vftНесоответствия.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втСводнаяТаблица.Ссылка КАК Ссылка,
	               |	втСводнаяТаблица.Код КАК Код,
	               |	втСводнаяТаблица.ОбъектПроверки КАК ОбъектПроверки,
	               |	втСводнаяТаблица.КонтролирующийОрган КАК КонтролирующийОрган,
	               |	втСводнаяТаблица.ФиоИнспектора КАК ФиоИнспектора,
	               |	втСводнаяТаблица.ДатаИнспекции КАК ДатаИнспекции,
	               |	втСводнаяТаблица.ТипыЗамечаний КАК ТипыЗамечаний,
	               |	втСводнаяТаблица.ПовторяющеесяЗамечания КАК ПовторяющеесяЗамечания,
	               |	втСводнаяТаблица.МестоИнспекции КАК МестоИнспекции,
	               |	втСводнаяТаблица.Закрыто КАК Закрыто,
	               |	втСводнаяТаблица.СрокиУстраненияДо КАК СрокиУстраненияДо,
	               |	втСводнаяТаблица.КодЗамечаний КАК КодЗамечаний,
	               |	втСводнаяТаблица.ЗамечаниеЗакрыто КАК ПодтвержденоЗакрытие,
	               |	втСводнаяТаблица.Служба КАК Служба,
	               |	втСводнаяТаблица.ПКДОтправлен КАК ПКДОтправлен,
	               |	втСводнаяТаблица.ПроектСудна КАК ПроектСудна,
	               |	втСводнаяТаблица.ТипМероприятия КАК ТипМероприятия,
	               |	втСводнаяТаблица.ОтчетОВыполненииПКДОтправлен КАК ОтчетОВыполненииПКДОтправлен,
	               |	втСводнаяТаблица.ДатаОтправкиОтчета КАК ДатаОтправкиОтчета
	               |ПОМЕСТИТЬ втГруппировкаЗамечаний
	               |ИЗ
	               |	втСводнаяТаблица КАК втСводнаяТаблица
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втСводнаяТаблица.Ссылка,
	               |	втСводнаяТаблица.КонтролирующийОрган,
	               |	втСводнаяТаблица.ОбъектПроверки,
	               |	втСводнаяТаблица.ФиоИнспектора,
	               |	втСводнаяТаблица.ПовторяющеесяЗамечания,
	               |	втСводнаяТаблица.Закрыто,
	               |	втСводнаяТаблица.ТипыЗамечаний,
	               |	втСводнаяТаблица.ДатаИнспекции,
	               |	втСводнаяТаблица.КодЗамечаний,
	               |	втСводнаяТаблица.ЗамечаниеЗакрыто,
	               |	втСводнаяТаблица.СрокиУстраненияДо,
	               |	втСводнаяТаблица.Код,
	               |	втСводнаяТаблица.Служба,
	               |	втСводнаяТаблица.МестоИнспекции,
	               |	втСводнаяТаблица.ПКДОтправлен,
	               |	втСводнаяТаблица.ПроектСудна,
	               |	втСводнаяТаблица.ТипМероприятия,
	               |	втСводнаяТаблица.ОтчетОВыполненииПКДОтправлен,
	               |	втСводнаяТаблица.ДатаОтправкиОтчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втГруппировкаЗамечаний.Ссылка КАК Ссылка,
	               |	втГруппировкаЗамечаний.Код КАК Код,
	               |	втГруппировкаЗамечаний.ОбъектПроверки КАК ОбъектПроверки,
	               |	втГруппировкаЗамечаний.КонтролирующийОрган КАК КонтролирующийОрган,
	               |	втГруппировкаЗамечаний.ФиоИнспектора КАК ФиоИнспектора,
	               |	втГруппировкаЗамечаний.ДатаИнспекции КАК ДатаИнспекции,
	               |	втГруппировкаЗамечаний.ТипыЗамечаний КАК ТипыЗамечаний,
	               |	втГруппировкаЗамечаний.ПовторяющеесяЗамечания КАК ПовторяющеесяЗамечания,
	               |	втГруппировкаЗамечаний.МестоИнспекции КАК МестоИнспекции,
	               |	втГруппировкаЗамечаний.Закрыто КАК Закрыто,
	               |	втГруппировкаЗамечаний.СрокиУстраненияДо КАК СрокиУстраненияДо,
	               |	втГруппировкаЗамечаний.КодЗамечаний КАК КодЗамечаний,
	               |	втГруппировкаЗамечаний.ПодтвержденоЗакрытие КАК ПодтвержденоЗакрытие,
	               |	втГруппировкаЗамечаний.Служба КАК Служба,
	               |	vftНесоответствия.ЗоныОтветственности.(
	               |		ЗанаОтветственности КАК Подразделение
	               |	) КАК ОтветственныеПодразделения,
	               |	втГруппировкаЗамечаний.ПКДОтправлен КАК ПКДОтправлен,
	               |	втГруппировкаЗамечаний.ПроектСудна КАК ПроектСудна,
	               |	втГруппировкаЗамечаний.ТипМероприятия КАК ТипМероприятия,
	               |	втГруппировкаЗамечаний.ОтчетОВыполненииПКДОтправлен КАК ОтчетОВыполненииПКДОтправлен,
	               |	втГруппировкаЗамечаний.ДатаОтправкиОтчета КАК ДатаОтправкиОтчета,
	               |	vftНесоответствия.ВладелецЗамечания КАК ВладелецЗамечания,
	               |	vftНесоответствия.Статус КАК Статус
	               |ИЗ
	               |	втГруппировкаЗамечаний КАК втГруппировкаЗамечаний
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.vftНесоответствия КАК vftНесоответствия
	               |		ПО втГруппировкаЗамечаний.Ссылка = vftНесоответствия.Ссылка
	               |ГДЕ
	               |	&УсловиеОтбора"; 
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстЗапросаДляСводногоВарианта()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	vftНесоответствия.Ссылка КАК Ссылка,
	               |	vftНесоответствия.Судно КАК ОбъектПроверки,
	               |	vftНесоответствия.ПовторяющеесяЗамечания КАК ПовторяющеесяЗамечания,
	               |	vftНесоответствия.КодЗамечаний КАК КодЗамечаний,
	               |	vftНесоответствия.ПланируемыеСрокиУстранения КАК СрокиУстраненияДо,
	               |	vftНесоответствия.ЗамечаниеЗакрыто КАК ПодтвержденоЗакрытие,
	               |	ВЫБОР
	               |		КОГДА vftНесоответствия.Статус = ЗНАЧЕНИЕ(перечисление.vftСтатусыДокументовСообщений.Закрыт)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Закрыто,
	               |	"" "" КАК Служба,
	               |	vftНесоответствия.ЗоныОтветственности.(
	               |		ЗанаОтветственности КАК Подразделение
	               |	) КАК ОтветственныеПодразделения,
	               |	vftНесоответствия.ТипЗамечания КАК ТипыЗамечаний,
	               |	vftНесоответствия.ПКДОтправлен КАК ПКДОтправлен,
	               |	vftСуда.Проект КАК ПроектСудна,
	               |	ЕСТЬNULL(рарусМероприятиеСУБ.КонтролирующийОрган, ЗНАЧЕНИЕ(Справочник.рарусКонтролирующиеОрганы.ПустаяСсылка)) КАК КонтролирующийОрган,
	               |	ЕСТЬNULL(рарусМероприятиеСУБ.ФиоИнспектора, """") КАК ФиоИнспектора,
	               |	ЕСТЬNULL(рарусМероприятиеСУБ.ДатаИнспекции, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаИнспекции,
	               |	ЕСТЬNULL(рарусМероприятиеСУБ.МестоПроведения, "" "") КАК МестоИнспекции,
	               |	vftНесоответствия.КодУстраненияЗамечания КАК Код,
	               |	рарусВидыМероприятийСУБ.ТипМероприятия КАК ТипМероприятия,
	               |	vftНесоответствия.ОтчетОВыполненииПКДОтправлен КАК ОтчетОВыполненииПКДОтправлен,
	               |	vftНесоответствия.ДатаОтправкиОтчета КАК ДатаОтправкиОтчета,
	               |	vftНесоответствия.ВладелецЗамечания КАК ВладелецЗамечания,
	               |	vftНесоответствия.Статус КАК Статус
	               |ИЗ
	               |	Справочник.vftНесоответствия КАК vftНесоответствия
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.vftСуда КАК vftСуда
	               |		ПО vftНесоответствия.Судно = vftСуда.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.рарусМероприятиеСУБ КАК рарусМероприятиеСУБ
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.рарусВидыМероприятийСУБ КАК рарусВидыМероприятийСУБ
	               |			ПО рарусМероприятиеСУБ.ВидМероприятия = рарусВидыМероприятийСУБ.Ссылка
	               |		ПО vftНесоответствия.ВладелецЗамечания = рарусМероприятиеСУБ.Ссылка
	               |ГДЕ
	               |	vftНесоответствия.Статус <> ЗНАЧЕНИЕ(Перечисление.vftСтатусыДокументовСообщений.Черновик)
	               |	И vftНесоответствия.Дата <= &ДатаОтчета
	               |	И &УсловиеОтбора
	               |	И vftНесоответствия.ДатаУстранения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |	И НЕ vftНесоответствия.ПометкаУдаления";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстЗапросаДляВариантаОтчетаЗамечанияРМРС()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	рарусСправочникСсылок.Значение КАК Значение
	               |ПОМЕСТИТЬ втОтборРМРС
	               |ИЗ
	               |	Справочник.рарусСправочникСсылок КАК рарусСправочникСсылок
	               |ГДЕ
	               |	рарусСправочникСсылок.Ссылка = ЗНАЧЕНИЕ(Справочник.рарусСправочникСсылок.РМРС)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	vftНесоответствия.Судно КАК ОбъектПроверки,
	               |	vftНесоответствия.Ссылка КАК Ссылка,
	               |	vftНесоответствия.ТипЗамечания КАК ТипыЗамечаний,
	               |	МероприятиеСУБ.КонтролирующийОрган КАК КонтролирующийОрган,
	               |	МероприятиеСУБ.МестоПроведения КАК МестоИнспекции,
	               |	МероприятиеСУБ.ДатаИнспекции КАК ДатаИнспекции,
	               |	vftНесоответствия.ПКДОтправлен КАК ПКДОтправлен,
	               |	ВЫБОР
	               |		КОГДА vftНесоответствия.Статус = ЗНАЧЕНИЕ(перечисление.vftСтатусыДокументовСообщений.Закрыт)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Закрыто,
	               |	"" "" КАК Служба,
	               |	vftНесоответствия.ПовторяющеесяЗамечания КАК ПовторяющеесяЗамечания,
	               |	vftНесоответствия.ПланируемыеСрокиУстранения КАК СрокиУстраненияДо,
	               |	vftНесоответствия.ЗамечаниеЗакрыто КАК ПодтвержденоЗакрытие,
	               |	vftНесоответствия.КодЗамечаний КАК КодЗамечаний,
	               |	vftНесоответствия.ЗоныОтветственности.(
	               |		ЗанаОтветственности КАК Подразделение
	               |	) КАК ОтветственныеПодразделения,
	               |	МероприятиеСУБ.ФиоИнспектора КАК ФиоИнспектора,
	               |	vftСуда.Проект КАК ПроектСудна,
	               |	vftНесоответствия.КодУстраненияЗамечания КАК Код,
	               |	ВидыМероприятийСУБ.ТипМероприятия КАК ТипМероприятия,
	               |	vftНесоответствия.ОтчетОВыполненииПКДОтправлен КАК ОтчетОВыполненииПКДОтправлен,
	               |	vftНесоответствия.ДатаОтправкиОтчета КАК ДатаОтправкиОтчета,
	               |	vftНесоответствия.ОтчетОВыполненииПКДОтправлен КАК ОтчетОВыполненииПКДОтправлен1,
	               |	vftНесоответствия.ДатаОтправкиОтчета КАК ДатаОтправкиОтчета1,
	               |	vftНесоответствия.ВладелецЗамечания КАК ВладелецЗамечания,
	               |	vftНесоответствия.Статус КАК Статус
	               |ИЗ
	               |	Справочник.vftНесоответствия КАК vftНесоответствия
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.рарусМероприятиеСУБ КАК МероприятиеСУБ
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.рарусВидыМероприятийСУБ КАК ВидыМероприятийСУБ
	               |			ПО МероприятиеСУБ.ВидМероприятия = ВидыМероприятийСУБ.Ссылка
	               |		ПО vftНесоответствия.ВладелецЗамечания = МероприятиеСУБ.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.vftСуда КАК vftСуда
	               |		ПО vftНесоответствия.Судно = vftСуда.Ссылка
	               |ГДЕ
	               |	vftНесоответствия.Статус <> ЗНАЧЕНИЕ(Перечисление.vftСтатусыДокументовСообщений.Черновик)
	               |	И НЕ vftНесоответствия.ПометкаУдаления
	               |	И vftНесоответствия.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И &УсловиеОтбора
	               |	И МероприятиеСУБ.КонтролирующийОрган В ИЕРАРХИИ
	               |			(ВЫБРАТЬ
	               |				втОтборРМРС.Значение КАК Значение
	               |			ИЗ
	               |				втОтборРМРС КАК втОтборРМРС)"; 	
	
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстЗапросаДляВариантаЗамечанийПоВнутреннимАудитамИПроверкам()
	
	ТекстЗапроса =  "ВЫБРАТЬ
	                |	vftНесоответствия.Ссылка КАК Ссылка,
	                |	vftНесоответствия.ТипЗамечания КАК ТипыЗамечаний,
	                |	vftНесоответствия.КодЗамечаний КАК КодЗамечаний,
	                |	vftНесоответствия.ПланируемыеСрокиУстранения КАК СрокиУстраненияДо,
	                |	vftНесоответствия.ПКДОтправлен КАК ПКДОтправлен,
	                |	vftНесоответствия.ПовторяющеесяЗамечания КАК ПовторяющеесяЗамечания,
	                |	vftНесоответствия.ЗамечаниеЗакрыто КАК ПодтвержденоЗакрытие,
	                |	МероприятиеСУБ.ФиоИнспектора КАК ФиоИнспектора,
	                |	ВЫБОР
	                |		КОГДА vftНесоответствия.Статус = ЗНАЧЕНИЕ(перечисление.vftСтатусыДокументовСообщений.Закрыт)
	                |			ТОГДА ИСТИНА
	                |		ИНАЧЕ ЛОЖЬ
	                |	КОНЕЦ КАК Закрыто,
	                |	"" "" КАК Служба,
	                |	МероприятиеСУБ.МестоПроведения КАК МестоИнспекции,
	                |	МероприятиеСУБ.ДатаИнспекции КАК ДатаИнспекции,
	                |	МероприятиеСУБ.КонтролирующийОрган КАК КонтролирующийОрган,
	                |	vftСуда.Проект КАК ПроектСудна,
	                |	vftНесоответствия.Судно КАК ОбъектПроверки,
	                |	vftНесоответствия.КодУстраненияЗамечания КАК Код,
	                |	ВидыМероприятийСУБ.ТипМероприятия КАК ТипМероприятия,
	                |	vftНесоответствия.ОтчетОВыполненииПКДОтправлен КАК ОтчетОВыполненииПКДОтправлен,
	                |	vftНесоответствия.ДатаОтправкиОтчета КАК ДатаОтправкиОтчета,
	                |	vftНесоответствия.ВладелецЗамечания КАК ВладелецЗамечания
	                |ПОМЕСТИТЬ втЗамечания
	                |ИЗ
	                |	Справочник.vftНесоответствия КАК vftНесоответствия
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.рарусМероприятиеСУБ КАК МероприятиеСУБ
	                |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.рарусВидыМероприятийСУБ КАК ВидыМероприятийСУБ
	                |			ПО МероприятиеСУБ.ВидМероприятия = ВидыМероприятийСУБ.Ссылка
	                |		ПО vftНесоответствия.ВладелецЗамечания = МероприятиеСУБ.Ссылка
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.vftСуда КАК vftСуда
	                |		ПО vftНесоответствия.Судно = vftСуда.Ссылка
	                |ГДЕ
	                |	vftНесоответствия.Статус <> ЗНАЧЕНИЕ(Перечисление.vftСтатусыДокументовСообщений.Черновик)
	                |	И НЕ vftНесоответствия.ПометкаУдаления
	                |	И vftНесоответствия.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	                |	И ВидыМероприятийСУБ.ТипМероприятия = ЗНАЧЕНИЕ(перечисление.рарусТипыМероприятия.ВнутреннийАудит)
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	втЗамечания.Ссылка КАК Ссылка,
	                |	втЗамечания.ТипыЗамечаний КАК ТипыЗамечаний,
	                |	втЗамечания.КодЗамечаний КАК КодЗамечаний,
	                |	втЗамечания.СрокиУстраненияДо КАК СрокиУстраненияДо,
	                |	втЗамечания.ПКДОтправлен КАК ПКДОтправлен,
	                |	втЗамечания.ПовторяющеесяЗамечания КАК ПовторяющеесяЗамечания,
	                |	втЗамечания.ПодтвержденоЗакрытие КАК ПодтвержденоЗакрытие,
	                |	втЗамечания.ФиоИнспектора КАК ФиоИнспектора,
	                |	втЗамечания.Закрыто КАК Закрыто,
	                |	втЗамечания.Служба КАК Служба,
	                |	втЗамечания.МестоИнспекции КАК МестоИнспекции,
	                |	втЗамечания.ДатаИнспекции КАК ДатаИнспекции,
	                |	втЗамечания.КонтролирующийОрган КАК КонтролирующийОрган,
	                |	втЗамечания.ПроектСудна КАК ПроектСудна,
	                |	втЗамечания.ОбъектПроверки КАК ОбъектПроверки,
	                |	vftНесоответствия.ЗоныОтветственности.(
	                |		ЗанаОтветственности КАК Подразделение
	                |	) КАК ОтветственныеПодразделения,
	                |	втЗамечания.ТипМероприятия КАК ТипМероприятия,
	                |	втЗамечания.ОтчетОВыполненииПКДОтправлен КАК ОтчетОВыполненииПКДОтправлен,
	                |	втЗамечания.ДатаОтправкиОтчета КАК ДатаОтправкиОтчета,
	                |	vftНесоответствия.Статус КАК Статус
	                |ИЗ
	                |	втЗамечания КАК втЗамечания
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.vftНесоответствия КАК vftНесоответствия
	                |		ПО втЗамечания.Ссылка = vftНесоответствия.Ссылка
	                |ГДЕ
	                |	&УсловиеОтбора";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстЗапросаДляПрочегоВариантОтчета()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	vftНесоответствия.Ссылка КАК Ссылка,
	               |	vftНесоответствия.Судно КАК ОбъектПроверки,
	               |	vftНесоответствия.ПовторяющеесяЗамечания КАК ПовторяющеесяЗамечания,
	               |	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаИнспекции,
	               |	vftНесоответствия.КодЗамечаний КАК КодЗамечаний,
	               |	ЗНАЧЕНИЕ(Справочник.РарусКонтролирующиеОрганы.ПустаяСсылка) КАК КонтролирующийОрган,
	               |	"" "" КАК МестоИнспекции,
	               |	vftНесоответствия.ПланируемыеСрокиУстранения КАК СрокиУстраненияДо,
	               |	vftНесоответствия.ЗамечаниеЗакрыто КАК ПодтвержденоЗакрытие,
	               |	ВЫБОР
	               |		КОГДА vftНесоответствия.Статус = ЗНАЧЕНИЕ(перечисление.vftСтатусыДокументовСообщений.Закрыт)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Закрыто,
	               |	"" "" КАК Служба,
	               |	vftНесоответствия.ЗоныОтветственности.(
	               |		ЗанаОтветственности КАК Подразделение
	               |	) КАК ОтветственныеПодразделения,
	               |	"" "" КАК ФиоИнспектора,
	               |	vftНесоответствия.ТипЗамечания КАК ТипыЗамечаний,
	               |	vftНесоответствия.ПКДОтправлен КАК ПКДОтправлен,
	               |	vftСуда.Проект КАК ПроектСудна,
	               |	vftНесоответствия.КодУстраненияЗамечания КАК Код,
	               |	vftНесоответствия.ОтчетОВыполненииПКДОтправлен КАК ОтчетОВыполненииПКДОтправлен,
	               |	vftНесоответствия.ДатаОтправкиОтчета КАК ДатаОтправкиОтчета,
	               |	vftНесоответствия.ВладелецЗамечания КАК ВладелецЗамечания,
	               |	vftНесоответствия.Статус КАК Статус
	               |ИЗ
	               |	Справочник.vftНесоответствия КАК vftНесоответствия
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.vftСуда КАК vftСуда
	               |		ПО vftНесоответствия.Судно = vftСуда.Ссылка
	               |ГДЕ
	               |	vftНесоответствия.Статус <> ЗНАЧЕНИЕ(Перечисление.vftСтатусыДокументовСообщений.Черновик)
	               |	И vftНесоответствия.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И &УсловиеОтбора
	               |	И НЕ vftНесоответствия.ПометкаУдаления";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстЗапросаДляКонтекстногоВариантаОтчета()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	vftНесоответствия.Ссылка КАК Ссылка,
	               |	vftНесоответствия.Судно КАК ОбъектПроверки,
	               |	vftНесоответствия.ПовторяющеесяЗамечания КАК ПовторяющеесяЗамечания,
	               |	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаИнспекции,
	               |	vftНесоответствия.КодЗамечаний КАК КодЗамечаний,
	               |	ЗНАЧЕНИЕ(Справочник.РарусКонтролирующиеОрганы.ПустаяСсылка) КАК КонтролирующийОрган,
	               |	"" "" КАК МестоИнспекции,
	               |	vftНесоответствия.ПланируемыеСрокиУстранения КАК СрокиУстраненияДо,
	               |	vftНесоответствия.ЗамечаниеЗакрыто КАК ПодтвержденоЗакрытие,
	               |	ВЫБОР
	               |		КОГДА vftНесоответствия.Статус = ЗНАЧЕНИЕ(перечисление.vftСтатусыДокументовСообщений.Закрыт)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Закрыто,
	               |	"" "" КАК Служба,
	               |	vftНесоответствия.ЗоныОтветственности.(
	               |		ЗанаОтветственности КАК Подразделение
	               |	) КАК ОтветственныеПодразделения,
	               |	"" "" КАК ФиоИнспектора,
	               |	vftНесоответствия.ТипЗамечания КАК ТипыЗамечаний,
	               |	vftНесоответствия.ПКДОтправлен КАК ПКДОтправлен,
	               |	vftСуда.Проект КАК ПроектСудна,
	               |	vftНесоответствия.КодУстраненияЗамечания КАК Код,
	               |	vftНесоответствия.ОтчетОВыполненииПКДОтправлен КАК ОтчетОВыполненииПКДОтправлен,
	               |	vftНесоответствия.ДатаОтправкиОтчета КАК ДатаОтправкиОтчета,
	               |	vftНесоответствия.ВладелецЗамечания КАК ВладелецЗамечания,
	               |	vftНесоответствия.Статус КАК Статус
	               |ИЗ
	               |	Справочник.vftНесоответствия КАК vftНесоответствия
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.vftСуда КАК vftСуда
	               |		ПО vftНесоответствия.Судно = vftСуда.Ссылка
	               |ГДЕ
	               |	vftНесоответствия.Статус <> ЗНАЧЕНИЕ(Перечисление.vftСтатусыДокументовСообщений.Черновик)
	               |	И &УсловиеОтбора
	               |	И НЕ vftНесоответствия.ПометкаУдаления";
	
	Возврат ТекстЗапроса;
	
КонецФункции


#КонецОбласти

#КонецЕсли
